bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
                <register caption="Ramp Y" name="RAMPY" offset="0x0A" size="1"/>
                <register caption="Ramp Z" name="RAMPZ" offset="0x0B" size="1"/>
                <register caption="Extended Indirect Jump" name="EIND" offset="0x0C" size="1"/>
                <register caption="Stack Pointer Low" name="SPL" offset="0x0D" size="1"/>
                <register caption="Stack Pointer High" name="SPH" offset="0x0E" size="1"/>
                <register caption="Status Register" name="SREG" offset="0x0F" size="1">
                    <bitfield caption="Global Interrupt Enable Flag" mask="0x80" name="I"/>
                    <bitfield caption="Transfer Bit" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="N Exclusive Or V Flag" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
            </register-group>
            <value-group caption="CCP signatures" name="CCP">
                <value caption="SPM Instruction Protection" name="SPM" value="0x9D"/>
                <value caption="IO Register Protection" name="IOREG" value="0xD8"/>
            </value-group>
        </module>
        <module name="CLK" id="I6073" version="XMEGAC" caption="Clock System">
            <register-group caption="Clock System" name="CLK" size="5">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="System Clock Selection" mask="0x07" name="SCLKSEL" values="CLK_SCLKSEL"/>
                </register>
                <register caption="Prescaler Control Register" name="PSCTRL" offset="0x01" size="1">
                    <bitfield caption="Prescaler A Division Factor" mask="0x7C" name="PSADIV" values="CLK_PSADIV"/>
                    <bitfield caption="Prescaler B and C Division factor" mask="0x03" name="PSBCDIV" values="CLK_PSBCDIV"/>
                </register>
                <register caption="Lock register" name="LOCK" offset="0x02" size="1">
                    <bitfield caption="Clock System Lock" mask="0x01" name="LOCK"/>
                </register>
                <register caption="RTC Control Register" name="RTCCTRL" offset="0x03" size="1">
                    <bitfield caption="Clock Source" mask="0x0E" name="RTCSRC" values="CLK_RTCSRC"/>
                    <bitfield caption="Clock Source Enable" mask="0x01" name="RTCEN"/>
                </register>
                <register caption="USB Control Register" name="USBCTRL" offset="0x04" size="1">
                    <bitfield caption="Prescaler Division Factor" mask="0x38" name="USBPSDIV" values="CLK_USBPSDIV"/>
                    <bitfield caption="Clock Source" mask="0x06" name="USBSRC" values="CLK_USBSRC"/>
                    <bitfield caption="Clock Source Enable" mask="0x01" name="USBSEN"/>
                </register>
            </register-group>
            <value-group caption="System Clock Selection" name="CLK_SCLKSEL">
                <value caption="Internal 2 MHz RC Oscillator" name="RC2M" value="0x00"/>
                <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x01"/>
                <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x02"/>
                <value caption="External Crystal Oscillator or Clock" name="XOSC" value="0x03"/>
                <value caption="Phase Locked Loop" name="PLL" value="0x04"/>
            </value-group>
            <value-group caption="Prescaler A Division Factor" name="CLK_PSADIV">
                <value caption="Divide by 1" name="1" value="0x00"/>
                <value caption="Divide by 2" name="2" value="0x01"/>
                <value caption="Divide by 4" name="4" value="0x03"/>
                <value caption="Divide by 8" name="8" value="0x05"/>
                <value caption="Divide by 16" name="16" value="0x07"/>
                <value caption="Divide by 32" name="32" value="0x09"/>
                <value caption="Divide by 64" name="64" value="0x0B"/>
                <value caption="Divide by 128" name="128" value="0x0D"/>
                <value caption="Divide by 256" name="256" value="0x0F"/>
                <value caption="Divide by 512" name="512" value="0x11"/>
            </value-group>
            <value-group caption="Prescaler B and C Division Factor" name="CLK_PSBCDIV">
                <value caption="Divide B by 1 and C by 1" name="1_1" value="0x00"/>
                <value caption="Divide B by 1 and C by 2" name="1_2" value="0x01"/>
                <value caption="Divide B by 4 and C by 1" name="4_1" value="0x02"/>
                <value caption="Divide B by 2 and C by 2" name="2_2" value="0x03"/>
            </value-group>
            <value-group caption="RTC Clock Source" name="CLK_RTCSRC">
                <value caption="1.024 kHz from internal 32kHz ULP" name="ULP" value="0x00"/>
                <value caption="1.024 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC" value="0x01"/>
                <value caption="1.024 kHz from internal 32.768 kHz RC oscillator" name="RCOSC" value="0x02"/>
                <value caption="32.768 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC32" value="0x05"/>
                <value caption="32.768 kHz from internal 32.768 kHz RC oscillator" name="RCOSC32" value="0x06"/>
                <value caption="External Clock from TOSC1" name="EXTCLK" value="0x07"/>
            </value-group>
            <value-group caption="USB Prescaler Division Factor" name="CLK_USBPSDIV">
                <value caption="Divide by 1" name="1" value="0x00"/>
                <value caption="Divide by 2" name="2" value="0x01"/>
                <value caption="Divide by 4" name="4" value="0x02"/>
                <value caption="Divide by 8" name="8" value="0x03"/>
                <value caption="Divide by 16" name="16" value="0x04"/>
                <value caption="Divide by 32" name="32" value="0x05"/>
            </value-group>
            <value-group caption="USB Clock Source" name="CLK_USBSRC">
                <value caption="PLL" name="PLL" value="0x00"/>
                <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x01"/>
            </value-group>
        </module>
        <module name="PR" id="I6073" version="XMEGAC" caption="Power Reduction">
            <register-group caption="Power Reduction" name="PR" size="7">
                <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
                    <bitfield caption="USB" mask="0x40" name="USB"/>
                    <bitfield caption="AES" mask="0x10" name="AES"/>
                    <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
                    <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
                    <bitfield caption="DMA-Controller" mask="0x01" name="DMA"/>
                </register>
                <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
                    <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
                </register>
