bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
            <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
                <value caption="Event Output Disabled" name="OFF" value="0x00"/>
                <value caption="Event Channel 7 Output on Port C pin 7" name="PC7" value="0x01"/>
                <value caption="Event Channel 7 Output on Port D pin 7" name="PD7" value="0x02"/>
                <value caption="Event Channel 7 Output on Port E pin 7" name="PE7" value="0x03"/>
            </value-group>
            <value-group caption="Event Output Select" name="PORTCFG_EVOUTSEL">
                <value caption="Event Channel 0 output to pin" name="0" value="0x00"/>
                <value caption="Event Channel 1 output to pin" name="1" value="0x01"/>
                <value caption="Event Channel 2 output to pin" name="2" value="0x02"/>
                <value caption="Event Channel 3 output to pin" name="3" value="0x03"/>
            </value-group>
        </module>
        <module name="CRC" id="I6111" version="XMEGAD" caption="Cyclic Redundancy Checker">
            <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
                    <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
                    <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
                    <bitfield caption="Busy" mask="0x01" name="BUSY"/>
                </register>
                <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
                <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
                <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
                <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
                <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
            </register-group>
            <value-group caption="Reset" name="CRC_RESET">
                <value caption="No Reset" name="NO" value="0x00"/>
                <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
                <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
            </value-group>
            <value-group caption="Input Source" name="CRC_SOURCE">
                <value caption="Disabled" name="DISABLE" value="0x00"/>
                <value caption="I/O Interface" name="IO" value="0x01"/>
                <value caption="Flash" name="FLASH" value="0x02"/>
            </value-group>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAC" caption="Event System">
            <register-group caption="Event System" name="EVSYS" size="18">
                <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
                    <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
                    <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
                    <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
                    <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Channel 0 Control Register" name="CH0CTRL" offset="0x08" size="1">
                    <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM" values="EVSYS_QDIRM"/>
                    <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
                    <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
                    <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
                </register>
                <register caption="Channel 1 Control Register" name="CH1CTRL" offset="0x09" size="1">
                    <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
                </register>
                <register caption="Channel 2 Control Register" name="CH2CTRL" offset="0x0A" size="1">
                    <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
                </register>
                <register caption="Channel 3 Control Register" name="CH3CTRL" offset="0x0B" size="1">
                    <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
                </register>
                <register caption="Event Strobe" name="STROBE" offset="0x10" size="1"/>
                <register caption="Event Data" name="DATA" offset="0x11" size="1"/>
            </register-group>
            <value-group caption="Quadrature Decoder Index Recognition Mode" name="EVSYS_QDIRM">
                <value caption="QDPH0 = 0, QDPH90 = 0" name="00" value="0x00"/>
                <value caption="QDPH0 = 0, QDPH90 = 1" name="01" value="0x01"/>
                <value caption="QDPH0 = 1, QDPH90 = 0" name="10" value="0x02"/>
                <value caption="QDPH0 = 1, QDPH90 = 1" name="11" value="0x03"/>
            </value-group>
