bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
            <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
                <value caption="RTC Off" name="OFF" value="0x00"/>
                <value caption="RTC Clock" name="DIV1" value="0x01"/>
                <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
                <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
                <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
                <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
                <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
                <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
            </value-group>
            <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="RTC">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
            </interrupt-group>
        </module>
        <module name="TWI" id="I6089" version="XMEGAAU" caption="Two-Wire Interface">
            <register-group caption="" name="TWI_MASTER" size="7">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_MASTER_INTLVL"/>
                    <bitfield caption="Read Interrupt Enable" mask="0x20" name="RIEN"/>
                    <bitfield caption="Write Interrupt Enable" mask="0x10" name="WIEN"/>
                    <bitfield caption="Enable TWI Master" mask="0x08" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Inactive Bus Timeout" mask="0x0C" name="TIMEOUT" values="TWI_MASTER_TIMEOUT"/>
                    <bitfield caption="Quick Command Enable" mask="0x02" name="QCEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_MASTER_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x03" size="1">
                    <bitfield caption="Read Interrupt Flag" mask="0x80" name="RIF"/>
                    <bitfield caption="Write Interrupt Flag" mask="0x40" name="WIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Arbitration Lost" mask="0x08" name="ARBLOST"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Bus State" mask="0x03" name="BUSSTATE" values="TWI_MASTER_BUSSTATE"/>
                </register>
                <register caption="Baud Rate Control Register" name="BAUD" offset="0x04" size="1"/>
                <register caption="Address Register" name="ADDR" offset="0x05" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x06" size="1"/>
            </register-group>
            <register-group caption="" name="TWI_SLAVE" size="6">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_SLAVE_INTLVL"/>
                    <bitfield caption="Data Interrupt Enable" mask="0x20" name="DIEN"/>
                    <bitfield caption="Address/Stop Interrupt Enable" mask="0x10" name="APIEN"/>
                    <bitfield caption="Enable TWI Slave" mask="0x08" name="ENABLE"/>
                    <bitfield caption="Stop Interrupt Enable" mask="0x04" name="PIEN"/>
                    <bitfield caption="Promiscuous Mode Enable" mask="0x02" name="PMEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_SLAVE_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Data Interrupt Flag" mask="0x80" name="DIF"/>
                    <bitfield caption="Address/Stop Interrupt Flag" mask="0x40" name="APIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Collision" mask="0x08" name="COLL"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Read/Write Direction" mask="0x02" name="DIR"/>
                    <bitfield caption="Slave Address or Stop" mask="0x01" name="AP"/>
                </register>
                <register caption="Address Register" name="ADDR" offset="0x03" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x04" size="1"/>
