bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
            <value-group caption="Event Selection" name="TC_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="CH0" value="0x08"/>
                <value caption="Event Channel 1" name="CH1" value="0x09"/>
                <value caption="Event Channel 2" name="CH2" value="0x0A"/>
                <value caption="Event Channel 3" name="CH3" value="0x0B"/>
            </value-group>
            <value-group caption="Error Interrupt Level" name="TC_ERRINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt Level" name="TC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture D Interrupt Level" name="TC_CCDINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture C Interrupt Level" name="TC_CCCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture B Interrupt Level" name="TC_CCBINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture A Interrupt Level" name="TC_CCAINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Timer/Counter Command" name="TC_CMD">
                <value caption="No Command" name="NONE" value="0x00"/>
                <value caption="Force Update" name="UPDATE" value="0x01"/>
                <value caption="Force Restart" name="RESTART" value="0x02"/>
                <value caption="Force Hard Reset" name="RESET" value="0x03"/>
            </value-group>
            <interrupt-group name="TC0">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="ERR" caption="Error Interrupt"/>
                <interrupt index="2" name="CCA" caption="Compare or Capture A Interrupt"/>
                <interrupt index="3" name="CCB" caption="Compare or Capture B Interrupt"/>
                <interrupt index="4" name="CCC" caption="Compare or Capture C Interrupt"/>
                <interrupt index="5" name="CCD" caption="Compare or Capture D Interrupt"/>
            </interrupt-group>
            <interrupt-group name="TC1">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="ERR" caption="Error Interrupt"/>
                <interrupt index="2" name="CCA" caption="Compare or Capture A Interrupt"/>
                <interrupt index="3" name="CCB" caption="Compare or Capture B Interrupt"/>
            </interrupt-group>
        </module>
        <module name="TC2" id="I6090" version="XMEGAD" caption="16-bit Timer/Counter type 2">
            <register-group caption="16-bit Timer/Counter type 2" name="TC2" size="48">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="TC2_CLKSEL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="High Byte Compare D Enable" mask="0x80" name="HCMPDEN"/>
                    <bitfield caption="High Byte Compare C Enable" mask="0x40" name="HCMPCEN"/>
                    <bitfield caption="High Byte Compare B Enable" mask="0x20" name="HCMPBEN"/>
                    <bitfield caption="High Byte Compare A Enable" mask="0x10" name="HCMPAEN"/>
                    <bitfield caption="Low Byte Compare D Enable" mask="0x08" name="LCMPDEN"/>
                    <bitfield caption="Low Byte Compare C Enable" mask="0x04" name="LCMPCEN"/>
                    <bitfield caption="Low Byte Compare B Enable" mask="0x02" name="LCMPBEN"/>
                    <bitfield caption="Low Byte Compare A Enable" mask="0x01" name="LCMPAEN"/>
                </register>
                <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="High Byte Compare D Output Value" mask="0x80" name="HCMPD"/>
                    <bitfield caption="High Byte Compare C Output Value" mask="0x40" name="HCMPC"/>
                    <bitfield caption="High Byte Compare B Output Value" mask="0x20" name="HCMPB"/>
                    <bitfield caption="High Byte Compare A Output Value" mask="0x10" name="HCMPA"/>
                    <bitfield caption="Low Byte Compare D Output Value" mask="0x08" name="LCMPD"/>
                    <bitfield caption="Low Byte Compare C Output Value" mask="0x04" name="LCMPC"/>
                    <bitfield caption="Low Byte Compare B Output Value" mask="0x02" name="LCMPB"/>
                    <bitfield caption="Low Byte Compare A Output Value" mask="0x01" name="LCMPA"/>
                </register>
                <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
                    <bitfield caption="Byte Mode" mask="0x03" name="BYTEM" values="TC2_BYTEM"/>
                </register>
