bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
            <value-group caption="SPI Mode" name="SPI_MODE">
                <value caption="SPI Mode 0" name="0" value="0x00"/>
                <value caption="SPI Mode 1" name="1" value="0x01"/>
                <value caption="SPI Mode 2" name="2" value="0x02"/>
                <value caption="SPI Mode 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Prescaler setting" name="SPI_PRESCALER">
                <value caption="System Clock / 4" name="DIV4" value="0x00"/>
                <value caption="System Clock / 16" name="DIV16" value="0x01"/>
                <value caption="System Clock / 64" name="DIV64" value="0x02"/>
                <value caption="System Clock / 128" name="DIV128" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="SPI_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="SPI">
                <interrupt index="0" name="INT" caption="SPI Interrupt"/>
            </interrupt-group>
        </module>
        <module name="IRCOM" id="I6090" version="XMEGAD" caption="IR Communication Module">
            <register-group caption="IR Communication Module" name="IRCOM" size="3">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
                </register>
                <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01" size="1"/>
                <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
            </register-group>
            <value-group caption="Event channel selection" name="IRDA_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="0" value="0x08"/>
                <value caption="Event Channel 1" name="1" value="0x09"/>
                <value caption="Event Channel 2" name="2" value="0x0A"/>
                <value caption="Event Channel 3" name="3" value="0x0B"/>
            </value-group>
        </module>
        <module name="FUSE" id="I6570" version="XMEGAD" caption="Fuses and Lockbits">
            <register-group caption="Fuses" name="NVM_FUSES" size="6">
                <register caption="Watchdog Configuration" name="FUSEBYTE1" offset="0x01" size="1" initval="0x00">
                    <bitfield caption="Watchdog Window Timeout Period" mask="0xF0" name="WDWPER" values="WDWPER"/>
                    <bitfield caption="Watchdog Timeout Period" mask="0x0F" name="WDPER" values="WDPER"/>
                </register>
                <register caption="Reset Configuration" name="FUSEBYTE2" offset="0x02" size="1" initval="0xFF">
                    <bitfield caption="Boot Loader Section Reset Vector" mask="0x40" name="BOOTRST" values="BOOTRST"/>
                    <bitfield caption="Timer Oscillator pin location" mask="0x20" name="TOSCSEL" values="TOSCSEL"/>
                    <bitfield caption="BOD Operation in Power-Down Mode" mask="0x03" name="BODPD" values="BODPD"/>
                </register>
                <register caption="Start-up Configuration" name="FUSEBYTE4" offset="0x04" size="1" initval="0xFF">
                    <bitfield caption="External Reset Disable" mask="0x10" name="RSTDISBL"/>
                    <bitfield caption="Start-up Time" mask="0x0C" name="STARTUPTIME" values="SUT"/>
                    <bitfield caption="Watchdog Timer Lock" mask="0x02" name="WDLOCK"/>
                </register>
                <register caption="EESAVE and BOD Level" name="FUSEBYTE5" offset="0x05" size="1" initval="0xFF">
                    <bitfield caption="BOD Operation in Active Mode" mask="0x30" name="BODACT" values="BODACT"/>
                    <bitfield caption="Preserve EEPROM Through Chip Erase" mask="0x08" name="EESAVE"/>
                    <bitfield caption="Brownout Detection Voltage Level" mask="0x07" name="BODLEVEL" values="BODLVL"/>
                </register>
            </register-group>
            <value-group caption="Boot Loader Section Reset Vector" name="BOOTRST">
                <value caption="Boot Loader Reset" name="BOOTLDR" value="0x00"/>
                <value caption="Application Reset" name="APPLICATION" value="0x01"/>
            </value-group>
            <value-group caption="Timer Oscillator pin location" name="TOSCSEL">
                <value caption="TOSC1 / TOSC2 on separate pins" name="ALTERNATE" value="0x00"/>
                <value caption="TOSC1 / TOSC2 shared with XTAL1 / XTAL2" name="XTAL" value="0x01"/>
            </value-group>
            <value-group caption="BOD operation" name="BODPD">
                <value caption="BOD enabled in sampled mode" name="SAMPLED" value="0x01"/>
                <value caption="BOD enabled continuously" name="CONTINUOUS" value="0x02"/>
                <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
            </value-group>
            <value-group caption="BOD operation" name="BODACT">
                <value caption="BOD enabled in sampled mode" name="SAMPLED" value="0x01"/>
                <value caption="BOD enabled continuously" name="CONTINUOUS" value="0x02"/>
                <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
            </value-group>
            <value-group caption="Watchdog (Window) Timeout Period" name="WDWPER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
            <value-group caption="Watchdog (Window) Timeout Period" name="WDPER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
            <value-group caption="Start-up Time" name="SUT">
                <value caption="0 ms" name="0MS" value="0x03"/>
                <value caption="4 ms" name="4MS" value="0x01"/>
                <value caption="64 ms" name="64MS" value="0x00"/>
            </value-group>
