bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32C4.xml
            <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
                <value caption="1.6 V" name="1V6" value="0x07"/>
                <value caption="1.8 V" name="1V8" value="0x06"/>
                <value caption="2.0 V" name="2V0" value="0x05"/>
                <value caption="2.2 V" name="2V2" value="0x04"/>
                <value caption="2.4 V" name="2V4" value="0x03"/>
                <value caption="2.6 V" name="2V6" value="0x02"/>
                <value caption="2.8 V" name="2V8" value="0x01"/>
                <value caption="3.0 V" name="3V0" value="0x00"/>
            </value-group>
        </module>
        <module name="LOCKBIT" id="I6570" version="XMEGAD" caption="Fuses and Lockbits">
            <register-group caption="Lock Bits" name="NVM_LOCKBITS">
                <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="FUSE_BLBB"/>
                    <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="FUSE_BLBA"/>
                    <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="FUSE_BLBAT"/>
                    <bitfield caption="Lock Bits" mask="0x03" name="LB" values="FUSE_LB"/>
                </register>
            </register-group>
            <value-group caption="Boot lock bits - boot section" name="FUSE_BLBB">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Boot lock bits - application section" name="FUSE_BLBA">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Boot lock bits - application table section" name="FUSE_BLBAT">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Lock bits" name="FUSE_LB">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
        </module>
        <module name="SIGROW" id="I3610" version="XMEGAC" caption="Signature Row">
            <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="64">
                <register caption="RCOSC 2 MHz Calibration Value B" name="RCOSC2M" offset="0x00" size="1"/>
                <register caption="RCOSC 2 MHz Calibration Value A" name="RCOSC2MA" offset="0x01" size="1"/>
                <register caption="RCOSC 32.768 kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value A" name="RCOSC32MA" offset="0x04" size="1"/>
                <register caption="Lot Number Byte 0, ASCII" name="LOTNUM0" offset="0x08" size="1"/>
                <register caption="Lot Number Byte 1, ASCII" name="LOTNUM1" offset="0x09" size="1"/>
                <register caption="Lot Number Byte 2, ASCII" name="LOTNUM2" offset="0x0A" size="1"/>
                <register caption="Lot Number Byte 3, ASCII" name="LOTNUM3" offset="0x0B" size="1"/>
                <register caption="Lot Number Byte 4, ASCII" name="LOTNUM4" offset="0x0C" size="1"/>
                <register caption="Lot Number Byte 5, ASCII" name="LOTNUM5" offset="0x0D" size="1"/>
                <register caption="Wafer Number" name="WAFNUM" offset="0x10" size="1"/>
                <register caption="Wafer Coordinate X Byte 0" name="COORDX0" offset="0x12" size="1"/>
                <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
                <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
                <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
                <register caption="USB Calibration Byte 0" name="USBCAL0" offset="0x1A" size="1"/>
                <register caption="USB Calibration Byte 1" name="USBCAL1" offset="0x1B" size="1"/>
                <register caption="USB RCOSC Calibration Value B" name="USBRCOSC" offset="0x1C" size="1"/>
                <register caption="USB RCOSC Calibration Value A" name="USBRCOSCA" offset="0x1D" size="1"/>
                <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
                <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 1" name="TEMPSENSE1" offset="0x2F" size="1"/>
            </register-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFN_QFP_44">
            <pin pad="PA5" position="1"/>
            <pin pad="PA6" position="2"/>
            <pin pad="PA7" position="3"/>
            <pin pad="PB0" position="4"/>
            <pin pad="PB1" position="5"/>
            <pin pad="PB2" position="6"/>
            <pin pad="PB3" position="7"/>
            <pin pad="GND" position="8"/>
            <pin pad="VCC" position="9"/>
            <pin pad="PC0" position="10"/>
            <pin pad="PC1" position="11"/>
            <pin pad="PC2" position="12"/>
            <pin pad="PC3" position="13"/>
            <pin pad="PC4" position="14"/>
            <pin pad="PC5" position="15"/>
            <pin pad="PC6" position="16"/>
            <pin pad="PC7" position="17"/>
            <pin pad="GND" position="18"/>
            <pin pad="VCC" position="19"/>
            <pin pad="PD0" position="20"/>
            <pin pad="PD1" position="21"/>
            <pin pad="PD2" position="22"/>
            <pin pad="PD3" position="23"/>
            <pin pad="PD4" position="24"/>
            <pin pad="PD5" position="25"/>
            <pin pad="PD6" position="26"/>
            <pin pad="PD7" position="27"/>
            <pin pad="PE0" position="28"/>
            <pin pad="PE1" position="29"/>
            <pin pad="GND" position="30"/>
            <pin pad="VCC" position="31"/>
            <pin pad="PE2" position="32"/>
            <pin pad="PE3" position="33"/>
            <pin pad="PDI" position="34"/>
            <pin pad="RESET" position="35"/>
            <pin pad="PR0" position="36"/>
            <pin pad="PR1" position="37"/>
            <pin pad="GND" position="38"/>
            <pin pad="AVCC" position="39"/>
            <pin pad="PA0" position="40"/>
            <pin pad="PA1" position="41"/>
            <pin pad="PA2" position="42"/>
            <pin pad="PA3" position="43"/>
            <pin pad="PA4" position="44"/>
        </pinout>
        <pinout name="BGA_49">
            <pin pad="PA3" position="A1"/>
            <pin pad="AVCC" position="A2"/>
            <pin pad="GND" position="A3"/>
            <pin pad="PR1" position="A4"/>
            <pin pad="PR0" position="A5"/>
            <pin pad="PDI" position="A6"/>
            <pin pad="PE3" position="A7"/>
            <pin pad="PA4" position="B1"/>
            <pin pad="PA1" position="B2"/>
            <pin pad="PA0" position="B3"/>
            <pin pad="GND" position="B4"/>
            <pin pad="RESET" position="B5"/>
            <pin pad="PE2" position="B6"/>
            <pin pad="VCC" position="B7"/>
            <pin pad="PA5" position="C1"/>
            <pin pad="PA2" position="C2"/>
            <pin pad="PA6" position="C3"/>
            <pin pad="PA7" position="C4"/>
            <pin pad="GND" position="C5"/>
            <pin pad="PE1" position="C6"/>
            <pin pad="GND" position="C7"/>
            <pin pad="PB1" position="D1"/>
            <pin pad="PB2" position="D2"/>
            <pin pad="PB3" position="D3"/>
            <pin pad="PB0" position="D4"/>
            <pin pad="GND" position="D5"/>
            <pin pad="PD7" position="D6"/>
            <pin pad="PE0" position="D7"/>
            <pin pad="GND" position="E1"/>
            <pin pad="GND" position="E2"/>
            <pin pad="PC3" position="E3"/>
            <pin pad="GND" position="E4"/>
            <pin pad="PD4" position="E5"/>
            <pin pad="PD5" position="E6"/>
            <pin pad="PD6" position="E7"/>
            <pin pad="VCC" position="F1"/>
            <pin pad="PC0" position="F2"/>
            <pin pad="PC4" position="F3"/>
            <pin pad="PC6" position="F4"/>
            <pin pad="PD0" position="F5"/>
            <pin pad="PD1" position="F6"/>
            <pin pad="PD3" position="F7"/>
            <pin pad="PC1" position="G1"/>
            <pin pad="PC2" position="G2"/>
            <pin pad="PC5" position="G3"/>
            <pin pad="PC7" position="G4"/>
            <pin pad="GND" position="G5"/>
            <pin pad="VCC" position="G6"/>
            <pin pad="PD2" position="G7"/>
        </pinout>
    </pinouts>
</target-description-file>
